Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/FastLED_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: Cosine version (90° phase shift from sin8):
it_it: Versione coseno (sfasamento di 90° da sin8):

source: Cost
it_it: Costo

source: Create LED visualizations that respond to audio input.
it_it: [fuzzy]Creare visualizzazioni LED che rispondono all'input audio.

source: Create a mirrored rainbow effect:
it_it: Creare un effetto arcobaleno speculare:

source: Create a rainbow that spans your entire LED strip:
it_it: Creare un arcobaleno che si estende sull'intera striscia LED:

source: Create a wider scanning effect:
it_it: Creare un effetto di scansione più ampio:

source: Create discrete rainbow blocks:
it_it: Crea blocchi di arcobaleno discreti:

source: Create effects that move from one strip to another.
it_it: Creare effetti che si spostano da una striscia all'altra.

source: Create gradients by varying blend amount across LEDs:
it_it: Creare gradienti variando la quantità di fusione sui LED:

source: Create groups of strips for easier management:
it_it: Creare gruppi di strisce per una gestione più semplice:

source: Create installations with strips at different angles or distances
it_it: Creare installazioni con strisce a diverse angolazioni o distanze

source: Create lines by setting consecutive LEDs:
it_it: Crea linee impostando LED consecutivi:

source: Create moving patterns using noise to control position:
it_it: Creare pattern in movimento usando il rumore per controllare la posizione:

source: Create multiple rainbow cycles across the strip:
it_it: Creare più cicli di arcobaleno lungo la striscia:

source: Create multiple scanning dots:
it_it: Creare più punti di scansione:

source: Create natural acceleration/deceleration:
it_it: Creare accelerazione/decelerazione naturale:

source: Create organic, flowing patterns using 2D noise:
it_it: Creare pattern organici e fluidi utilizzando il rumore 2D:

source: Create professional-grade LED installations and effects.
it_it: Creare installazioni ed effetti LED di livello professionale.

source: Create rhythmic patterns with beat generators:
it_it: Crea pattern ritmici con i generatori di battiti:

source: Create simplest possible sketch to isolate issues:
it_it: Creare lo sketch più semplice possibile per isolare i problemi:

source: Create trails and decay effects:
it_it: Crea effetti di scie e decadimento:

source: Create wave patterns across LEDs:
it_it: Creare pattern d'onda sui LED:

source: Create your own color palettes to match your specific needs:
it_it: Creare le palette di colori in base alle proprie esigenze specifiche:

source: Creates "depth" to animation
it_it: Crea "profondità" all'animazione

source: Creating Colors
it_it: Creazione di Colori

source: Creating HSV Colors
it_it: Creazione di Colori HSV

source: Creating RGB Colors
it_it: Creazione di colori RGB

source: Creating a Rainbow
it_it: Creazione di un Arcobaleno

source: Creating directional wave effects: ripples expanding from center point, dual waves with phase offsets, traveling peaks
it_it: Creazione di effetti di onde direzionali: increspature che si espandono dal punto centrale, onde doppie con offset di fase, picchi in movimento

source: Creating fade effects with `fadeToBlackBy()` and fading to specific colors for trails and transitions
it_it: Creare effetti di dissolvenza con `fadeToBlackBy()` e sfumare a colori specifici per scie e transizioni

source: Creating organic, realistic animations through randomness and physics-inspired rules
it_it: Creazione di animazioni organiche e realistiche attraverso la casualità e regole ispirate alla fisica

source: Creating phased breathing effects where LEDs pulse in sequence using phase offset parameter
it_it: Creazione di effetti di respirazione a fasi in cui i LED pulsano in sequenza utilizzando il parametro offset fase

source: Creating variations (starfield, party lights, fireflies) by adjusting parameters
it_it: Creazione di varianti (campo stellare, luci da festa, lucciole) regolando i parametri

source: Critical for strips over 100 LEDs
it_it: Fondamentale per strisce con oltre 100 LED

source: Cross-fading between complete patterns and layering multiple effects
it_it: Dissolvenza incrociata tra pattern completi e sovrapposizione di più effetti

source: Cubic Easing
it_it: Facilitazione Cubica

source: Current Limits by Power Source
it_it: Limiti di Corrente per Sorgente di Alimentazione

source: Current Requirements
it_it: Requisiti di Corrente

source: Custom Non-Blocking Timing
it_it: Temporizzazione Non Bloccante Personalizzata

source: Custom Palette with Multiple Colors
it_it: Palette Personalizzata con Più Colori

source: Custom Palettes
it_it: Palette Personalizzate

source: Customizable Fire
it_it: Fuoco Personalizzabile

source: Customization
it_it: Personalizzazione

source: Customization Tips
it_it: Suggerimenti per la Personalizzazione

source: Cycle through colors as it scans:
it_it: Ciclare i colori durante la scansione:

source: Data corruption
it_it: Danneggiamento dei dati

source: Data corruption validation
it_it: Validazione di dati corrotti

source: Data pin in code matches physical wiring
it_it: Pin dati nel codice corrispondente al cablaggio fisico

source: Data signal degradation
it_it: Degrado del segnale dati

source: Data signal degradation along strip
it_it: Degrado del segnale dati lungo la striscia

source: Data signal issue (not power)
it_it: Problema con il segnale dati (non con l'alimentazione)

source: Data signal reaching all LEDs
it_it: Segnale dati che raggiunge tutti i LED

source: Debugging Color Issues
it_it: Debug dei problemi di colore

source: Debugging Strategies
it_it: Strategie di Debug

source: Debugging Timing Issues
it_it: Debug dei Problemi di Temporizzazione

source: Debugging Tips
it_it: Suggerimenti per il Debug

source: Debugging color issues with systematic color testing, checking COLOR_ORDER settings, and printing RGB values
it_it: Debug dei problemi di colore con test sistematici, controllo delle impostazioni COLOR_ORDER e stampa dei valori RGB

source: Dedicated LED PSU
it_it: Alimentatore LED dedicato

source: Desaturate Effect
it_it: Effetto Desaturazione

source: Detect beats/kicks in music for reactive effects.
it_it: Rileva i ritmi nella musica per effetti reattivi.

source: Different Colors
it_it: Colori Diversi

source: Different LED types use different color orders:
it_it: Diversi tipi di LED utilizzano ordini di colore diversi:

source: Different parts can fade at different speeds:
it_it: Parti diverse possono dissolversi a velocità diverse:

source: Dimmer LEDs at the end
it_it: LED dimmerabili all'estremità

source: Direct Access
it_it: Accesso Diretto

source: Direct Color Definition
it_it: Definizione Diretta del Colore

source: Direct Pixel Addressing
it_it: Indirizzamento Diretto dei Pixel

source: Direct RGB Values
it_it: Valori RGB Diretti

source: Direct pixel addressing: `leds[i] = CRGB::Red`
it_it: Indirizzamento diretto dei pixel: `leds[i] = CRGB::Red`

source: Disable WiFi during LED updates for smoother output
it_it: Disattivare il Wi-Fi durante gli aggiornamenti dei LED per un output più fluido

source: Disable only if you need maximum frame rate.
it_it: Disattivarlo solo se c'è bisogno del massimo frame rate.

source: Discover how to use FastLED's noise functions to create organic, natural-looking animations.
it_it: Scoprire come utilizzare le funzioni di rumore di FastLED per creare animazioni organiche e dall'aspetto naturale.

source: Display Functions
it_it: Funzioni di Visualizzazione

source: Display and timing functions for updating and controlling animations
it_it: Funzioni di visualizzazione e temporizzazione per l'aggiornamento e il controllo delle animazioni

source: Distance-Based Brightness
it_it: Luminosità Basata sulla Distanza

source: Dithering reduces visible banding in color gradients but costs performance.
it_it: Il dithering riduce le bande visibili nei gradienti di colore, ma riduce le prestazioni.

source: Divisor 10-100 controls speed
it_it: Il divisore 10-100 controlla la velocità

source: Do not use lone ::, :code: or ..
it_it: Non utilizzare solo ::, :code: o ..

source: Documentation
it_it: Documentazione

source: Docutils References (Fundamentals)
it_it: Riferimenti a Docutils (Fondamenti))

source: Don't Mix Models Unnecessarily
it_it: Non Mescolare i Modelli Inutilmente

source: Don't Power LEDs from Microcontroller
it_it: Non Alimentare i LED dal Microcontrollore

source: Don't rely on power traveling through entire strip
it_it: Non fare affidamento sulla corrente che attraversa l'intera striscia

source: Don't update LEDs faster than necessary.
it_it: Non aggiornare i LED più velocemente del necessario.

source: Don't update faster than necessary:
it_it: Non aggiornare più velocemente del necessario:

source: Double-check +5V and GND not swapped
it_it: Verificare che +5V e GND non siano invertiti

source: Double-check that `LED_PIN` in your code matches the physical pin
it_it: Controllare attentamente che `LED_PIN` nel codice corrisponda al pin fisico

source: Double-check your wiring against the diagrams in [Hardware Problems](hardware.md)
it_it: Controllare attentamente il cablaggio rispetto agli schemi in [Problemi Hardware](hardware)

source: Download the latest release from [GitHub](https://github.com/FastLED/FastLED/releases)
it_it: Scaricare l'ultima versione da [GitHub](https://github.com/FastLED/FastLED/releases)

source: Drawing Lines
it_it: Disegno di Linee

source: Dual Breathing
it_it: Respirazione Doppia

source: Dual Direction Rainbow
it_it: Arcobaleno a Doppia Direzione

source: Dynamic Brightness
it_it: Luminosità Dinamica

source: E.g. Visit https://lvgl.io.
it_it: Ad esempio Visitare https://lvgl.io.

source: ESP32 Pin Selection
it_it: Selezione dei pin dell'ESP32

source: ESP32 Specific Issues
it_it: Problemi specifici dell'ESP32

source: ESP32 WiFi Interference
it_it: Interferenza WiFi ESP32

source: ESP32/ESP8266: Much more RAM available
it_it: ESP32/ESP8266: molta più RAM disponibile

source: ESP32: Use RMT-capable pins for best performance
it_it: ESP32: Usa pin compatibili con RMT per prestazioni ottimali

source: ESP8266: Limited pins, use GPIO carefully
it_it: ESP8266: Pin limitati, usa GPIO con cautela

source: EVERY_N_MILLISECONDS Macro
it_it: La Macro EVERY_N_MILLISECONDS

source: EVERY_N_SECONDS Macro
it_it: Macro EVERY_N_SECONDS

source: Each LED = 3 bytes (RGB)
it_it: Ogni LED = 3 byte (RGB)

source: Each LED has an index starting from 0:
it_it: Ogni LED ha un indice che parte da 0:

source: Each LED in your strip has an **index** (position) starting from 0.
it_it: Ogni LED della striscia ha un **indice** (posizione) che inizia da 0.

source: Each LED uses 3 bytes (RGB)
it_it: Ogni LED utilizza 3 byte (RGB)

source: Each LED uses 3 bytes (RGB).
it_it: Ogni LED utilizza 3 byte (RGB).

source: Each LED uses 3 bytes (RGB):
it_it: Ogni LED utilizza 3 byte (RGB):

source: Each LED uses 3 bytes of RAM:
it_it: Ogni LED utilizza 3 byte di RAM:

source: Each color channel ranges from 0-255:
it_it: Ogni canale colore varia da 0 a 255:

source: Each individual LED functional and addressable
it_it: Ogni singolo LED funzionante e indirizzabile

source: Each list is terminated by the next ..
it_it: Ogni elenco termina con la successiva pseudo-direttiva ..

source: Each pattern builds on concepts from the previous ones, so following this order is recommended for beginners.
it_it: Ogni pattern si basa sui concetti dei precedenti, quindi seguire questo ordine è consigliato ai principianti.

source: Each recipe is designed to be copied directly into your Arduino sketch.
it_it: Ogni ricetta è progettata per essere copiata direttamente nello sketch Arduino.

source: Each recipe is self-contained with complete code examples and explanations.
it_it: Ogni ricetta è autonoma e corredata di esempi di codice e spiegazioni complete.

source: Each strip runs a different effect.
it_it: Ogni striscia esegue un effetto diverso.

source: Ease of Use
it_it: Facilità d'Uso

source: Eased Transitions
it_it: Transizioni Fluide

source: Easier to create smooth color transitions (just change hue)
it_it: Creazione più semplice di transizioni di colore fluide (basta cambiare tonalità)

source: Easier to create smooth color transitions (just increment hue)
it_it: Più facile creare transizioni di colore fluide (basta incrementare la tonalità)

source: Easing Functions
it_it: Funzioni di Facilitazione

source: Efficient Array Operations
it_it: Operazioni Efficienti sugli Array

source: Electret microphone module or audio line-in circuit
it_it: Modulo microfono electret o circuito di ingresso audio

source: Electromagnetic interference
it_it: Interferenza elettromagnetica

source: Emphasis using *italics*.
it_it: Enfasi con *corsivo*.

source: Emphasis using **boldface**.
it_it: Enfasi con **grassetto**.

source: Enforcement
it_it: Applicazione

source: Ensure FastLED.show() is called once per frame
it_it: Assicurarsi che FastLED.show() venga chiamato una volta per frame

source: Ensure power supply is plugged in and turned on
it_it: Assicurarsi che l'alimentatore sia collegato e acceso

source: Ensure solid ground connections
it_it: Assicurarsi che i collegamenti di terra siano solidi

source: Ensure wire is making good contact
it_it: Assicurarsi che il filo faccia un buon contatto

source: Erratic LED behavior
it_it: Comportamento irregolare dei LED

source: Essential Components
it_it: Componenti Essenziali

source: Essential for stable operation
it_it: Essenziale per un funzionamento stabile

source: Essential safety components (capacitor, resistor) and why they matter
it_it: Componenti di sicurezza essenziali (condensatore, resistenza) e perché sono importanti

source: Estimating in Code
it_it: Stimare in codice

source: Every FastLED program follows this pattern:
it_it: Ogni programma FastLED segue questo pattern:

source: Example
it_it: Esempio

source: Example Optimization
it_it: Esempio di Ottimizzazione

source: Example Power-Safe Setup
it_it: Esempio di Configurazione Power-Safe

source: Example concept (requires FFT library):
it_it: Esempio di concetto (richiede la libreria FFT):

source: Example:
it_it: Esempio:

source: Example: 100 LEDs = 6A minimum
it_it: Esempio: 100 LED = 6A minimo

source: Example: Complete Palette Effect
it_it: Esempio: Effetto Palette Completo

source: Examples of behavior that contributes to creating a positive environment include:
it_it: Esempi di comportamento che contribuiscono a creare un ambiente positivo includono:

source: Examples of representing a project or community include using an official project e-mail address, posting via an official social media account, or acting as an appointed representative at an online or offline event.
it_it: Esempi di rappresentanza di un progetto o di una community includono l'utilizzo di un indirizzo e-mail ufficiale del progetto, la pubblicazione tramite un account social media ufficiale o l'agire come rappresentante designato a un evento online o offline.

source: Examples of unacceptable behavior by participants include:
it_it: Esempi di comportamento inaccettabile da parte dei partecipanti includono:

source: Examples:
it_it: Esempi:

source: Examples: :u:`underline` , :ub:`underline and bold` , :bi:`bold italic` .
it_it: Esempi: :u:`underline` [sottolineato], :ub:`underline and bold` [sottolineato e grassetto], :bi:`bold italic`[grassetto corsivo].

source: Excellent performance
it_it: Prestazioni eccellenti

source: Excellent with PIO
it_it: Eccellente con PIO

source: Exception: the substitutions.txt file contains 3 substitution definitions which are marked with the :trim: option since their use always removes these spaces in the output.
it_it: Eccezione: il file substitutions.txt contiene 3 definizioni di sostituzione contrassegnate con l'opzione :trim:, poiché il loro utilizzo rimuove sempre questi spazi nell'output.

source: Expanding ripples from a center point:
it_it: Espansione delle "ripple" [increspature] da un punto centrale:

source: Experiment with **Rainbow** effects to master HSV color space
it_it: Sperimentare con gli effetti **Arcobaleno** per padroneggiare lo spazio colore HSV

source: Experiment with different color mappings (hue, saturation, or brightness)
it_it: Sperimenta diverse mappature di colore (tonalità, saturazione o luminosità)

source: Experiment with different colors for different moods
it_it: Sperimentare con colori diversi per creare atmosfere diverse

source: Experiment with different frame rates for your installation
it_it: Sperimentare diversi frame rate per l'installazione

source: Experiment with different increment values for faster/slower fades
it_it: Sperimenta con diversi valori di incremento per dissolvenze più veloci/lente

source: Experiment with different noise scales for unique effects
it_it: Sperimentare con diverse scale di rumore per effetti unici

source: Experiment with different threshold values for your environment
it_it: Sperimentare diversi valori di soglia per il proprio ambiente

source: Experiment with phase offsets between strips
it_it: Sperimentare con gli sfasamenti tra le strisce

source: Experimental Features (Not Production Ready)
it_it: Funzionalità Sperimentali (Non Pronte per la Produzione)

source: Explanation:
it_it: Spiegazione:

source: Explore FastLED's mathematical utilities including scaling, wave functions, easing, and beat generators.
it_it: Esplorare le utilità matematiche di FastLED, tra cui ridimensionamento, funzioni d'onda, easing e generatori di beat.

source: Explore [Rainbow Effects](rainbow.md) to learn how to create smooth color cycling patterns using HSV color space.
it_it: Esplorare gli [Effetti Arcobaleno](rainbow) per imparare a creare pattern di cicli di colori fluidi utilizzando lo spazio colore HSV.

source: Expression
it_it: Espressione

source: External Links
it_it: Link Esterni

source: External resources and community links for additional FastLED help
it_it: Risorse esterne e link alla community per ulteriore supporto per FastLED

source: Extract the archive
it_it: Estrarre l'archivio

source: Fade In/Out Effect
it_it: Effetto Fade In/Out

source: Fade to Black
it_it: Dissolvenza in Nero

source: Fade to Specific Color
it_it: Dissolvenza a un Colore Specifico

source: Fast 8-bit scaling, essential for brightness control:
it_it: Scala veloce a 8 bit, essenziale per il controllo della luminosità:

source: Fast 8-bit sine wave (0-255 input, 0-255 output):
it_it: Onda sinusoidale veloce a 8 bit (ingresso 0-255, uscita 0-255):

source: Fast CPU (240 MHz)
it_it: CPU veloce (240 MHz)

source: Fast random number generation:
it_it: Generazione rapida di numeri casuali:

source: Fast: FastLED Functions
it_it: Veloce: Funzioni FastLED

source: FastLED Cookbook
it_it: Ricettario FastLED

source: FastLED Documentation: https://fastled.io
it_it: Documentazione FastLED: https://fastled.io

source: FastLED Recipes
it_it: Ricette FastLED

source: FastLED Reference Guide
it_it: Guida di Riferimento FastLED

source: FastLED builds on classical LED programming techniques where you directly manipulate pixel arrays.
it_it: FastLED si basa sulle tecniche classiche di programmazione LED in cui è possibile manipolare direttamente array di pixel.

source: FastLED can automatically limit power draw:
it_it: FastLED può limitare automaticamente il consumo energetico:

source: FastLED can estimate power draw:
it_it: FastLED può stimare l'assorbimento di potenza:

source: FastLED comes with several built-in color palettes ready to use:
it_it: FastLED include diverse palette di colori native pronte all'uso:

source: FastLED documentation
it_it: Documentazione FastLED

source: FastLED doesn't provide RGB-to-HSV conversion.
it_it: FastLED non fornisce la conversione da RGB a HSV.

source: FastLED includes noise functions for creating organic, natural-looking animations.
it_it: FastLED include funzioni di rumore per creare animazioni organiche e dall'aspetto naturale.

source: FastLED makes it easy to control multiple LED strips from a single microcontroller.
it_it: FastLED semplifica il controllo di più strisce LED da un singolo microcontrollore.

source: FastLED provides a rich set of mathematical functions optimized for LED animations.
it_it: FastLED offre un ricco set di funzioni matematiche ottimizzate per le animazioni LED.

source: FastLED provides convenient named colors:
it_it: FastLED fornisce pratici colori con nome:

source: FastLED provides its own delay function with built-in dithering:
it_it: FastLED offre una propria funzione di ritardo con dithering integrato:

source: FastLED provides many named colors:
it_it: FastLED fornisce molti colori con nome:

source: FastLED provides powerful functions for fading, blending, and transitioning between colors and patterns.
it_it: FastLED offre potenti funzioni per dissolvenza, fusione e transizione tra colori e pattern.

source: FastLED provides several noise functions:
it_it: FastLED fornisce diverse funzioni di rumore:

source: FastLED supports a wide range of microcontrollers:
it_it: FastLED supporta un'ampia gamma di microcontrollori:

source: FastLED supports numerous LED chipsets including:
it_it: FastLED supporta numerosi chipset LED, tra cui:

source: FastLED supports two main color models:
it_it: FastLED supporta due modelli di colore principali:

source: FastLED treats as RGB only
it_it: FastLED funziona solo come RGB

source: FastLED.show() updates all registered controllers efficiently, so you don't need to call it separately for each strip.
it_it: FastLED.show() aggiorna tutti i controller registrati in modo efficiente, quindi non è necessario richiamarlo separatamente per ogni striscia.

source: Feature
it_it: Caratteristiche

source: Fill Entire Strip
it_it: Riempire l'Intera Striscia

source: Fill a Range
it_it: Riempire un Intervallo

source: Fill a Subset
it_it: Riempire un Sottoinsieme

source: Fill a specific section of your strip:
it_it: Riempire una sezione specifica della striscia:

source: Fill all LEDs with a single color:
it_it: Riempire tutti i LED con un singolo colore:

source: Fill only a portion of the strip:
it_it: Riempire solo una parte della striscia:

source: Fill with HSV
it_it: Riempire con HSV

source: Fire Effect
it_it: Effetto Fiamma

source: Fire effect
it_it: Effetto fuoco

source: Fire simulation
it_it: Movimento del fuoco

source: Fire simulation techniques using heat arrays and color palettes
it_it: Tecniche di simulazione del fuoco utilizzando array di calore e palette di colori

source: First LED Flickers or Wrong
it_it: Il primo LED lampeggia o è errato

source: First LED Wrong, Rest OK
it_it: Primo LED Non Funzionante, il Resto OK

source: First LED Wrong/Flickering
it_it: Primo LED Errato/Sfarfallìo

source: First LED functionality (most common failure point)
it_it: Funzionalità del primo LED (punto di guasto più comune)

source: First LED issues
it_it: Problemi con i primi LED

source: First LED problems
it_it: Primi problemi al LED

source: First few LEDs different colors
it_it: I primi LED hanno colori diversi

source: Flickering
it_it: Sfarfallìo

source: Flickering and instability
it_it: Sfarfallio e instabilità

source: Float Division (Slow)
it_it: Divisione in Virgola Mobile (Lenta)

source: Floating-point operations are slow on microcontrollers.
it_it: Le operazioni in virgola mobile sono lente sui microcontrollori.

source: Focusing on what is best for the community
it_it: Concentrarsi su ciò che è meglio per la comunità

source: Follow [Installation and Setup](installation.md) for your development environment
it_it: Seguire [Installazione e Configurazione](installation) per l'ambiente di sviluppo

source: Follows existing code style
it_it: Segua lo stile del codice esistente
